[
    {
        "id":"nervestimu",
        "title":"Peripheral Nerve Stimulation",
        "description":"Peripheral nerve stimulation is emerging as a potential long-term therapy for Overactive Bladder. The aim of this study is to investigate the feasibility of selectively activating therapeutically-relevant nerve(s) by transcutaneous electrical nerve stimulation.",        "expectations":"Some example questions that the student should investigate include: Why do some stations empty while at others the arrivals and departures tend to balance? Why are some stations busy while other, close-by stations are not? What is the optimal station size for a given location? What are the best locations? What is the mix of subscription users vs. casual users at a given location and can this be predicted? What is the optimal size of the system? What is the best pricing for subscriptions and casual users?",
        "time-commitment":"2-3 Hours/Week",
        "expectations":"Conduct feasibility tests of electrically activating peripheral nerves in human participants.",
        "credentials":"Any year and discipline.",
        "prof":"J. Zariffa",
        "profphoto":"http://ibbme.utoronto.ca/wp-content/uploads/2013/08/Paul-Yoo-133x200.jpg",
        "bio":"Associate Professor, Biomaterials & Biomedical Engineering / Electrical & Computer Engineering",
        "link":"http://www.ibbme.utoronto.ca/faculty/core-faculty/paul-yoo/",
        "area":"Biomedical Engineering",
        "student":"3-5 positions available"
    },
    {
        "id":"neuralstim",
        "title":"Personalized Neural Stimulation/Recording Headset",
        "description":"Therapeutic brain stimulation is a rapidly advancing field within neuroscience and medicine. The effectiveness of the technique requires accurate localization of the target brain regions for recording and/or stimulation for various clinical and experimental procedures. However, individual variation in skull anatomy and size causes it to be difficult to consistently locate a specific region for multiple recording/stimulation sessions. Image guided placement methods of recorders/stimulators such as MRIs, are expensive and time consuming. Manual methods such as tape measurements are time consuming, require a technician, and lack consistency for multiple recording/stimulation sessions. Our project will improve upon existing techniques, minimizing time and expense while ensuring accuracy and consistency of neural recording/stimulation. A personalized stimulation headset will be 3D printed that targets the desired brain region for that patient. The method begins by using a series of digital photos of the patient to create a 3D model of their head. Using a computer algorithm, a personalized headset locating the target area will be 3D printed to fit the patient’s head and pinpoint the target region.",
        "time-commitment":"4-6 Hours/Week",
        "expectations":"Headset design specific for repetitive transcranial stimulation (rTMS), Software design and implementation allowing to scan and print the headset, Testing of both the headset and the software",
        "credentials":"Any year and discipline, as long as the student is motivated.",
        "prof":"J. Zariffa",
        "profphoto":"http://ibbme.utoronto.ca/wp-content/uploads/2013/08/Paul-Yoo-133x200.jpg",
        "bio":"Assistant Professor, Biomaterials & Biomedical Engineering / Electrical & Computer Engineering",
        "link":"http://www.neuroscience.utoronto.ca/Assets/Neuroscience+Digital+Assets/Neuroscience/UTNP+Digital+Assets/images/faculty/zariffa.jpg",
        "area":"Biomedical Engineering",
        "student":"2-4 positions available"
    },
    {
        "id":"globalclim",
        "title":"Global Climate Model Reconstruction",
        "description":"The idea of this project is to build a reconstruction of the first ever global climate model. The original model was developed in 1895, by a Swedish scientist, Svante Arrhenius. Most histories of climate science credit him with the discovery of global warming, although at the time he was really trying to prove that a drop in carbon dioxide concentrations in the atmosphere could have caused the ice ages. His model was at least fifty years ahead of its time, both scientifically and computationally - most notably, there were no digital computers at the time, so all his calculations were done by hand. The model is interesting today because it demonstrates some subtle properties of the greenhouse effect, beyond what is taught in most classrooms. So far as I can discover, nobody has attempted a modern-day reconstruction of his model. The goal of this project is to implement his model in a modern programming language, and put it on the web so that students learning about climate change can run it and see what it does. Depending on interest, the project could also include building a graphical front end to illustrate how the model works, and to develop variants of the model that incorporate more recent data, e.g. satellite measurements of carbon dioxide concentrations and infra-red absorption.",
        "time-commitment":"Open, depending on interest and commitment.",
        "expectations":"The project is open ended. A working program should be relatively straightforward for a reasonably competent programmer. Further enhancements (e.g. web design, graphical representations, etc) will depend on interest and ability. We could also attempt to track down original notebooks and other sources from these scientists, and explore variants of the original model.",
        "credentials":"Any discipline. Requires a student with competent programming skills, and an interest in (or willingness to learn) the history of science and the early development of climate science. Experience with web design and graphical user interfaces would also be helpful.",
        "prof":"S. Easterbrook",
        "profphoto":"http://www.cs.toronto.edu/~sme/images/photos/me21.jpg",
        "bio":"Professor, Computer Science",
        "link":"http://www.cs.toronto.edu/~sme/",
        "area":"Computer Science",
        "student":"1-2 positions available"
    },
    {
        "id":"epigenomics",
        "title":"Epigenomics analysis software packaging",
        "description":"You will contribute to open source computational biology projects such as Segway and Genomedata to facilitate their distribution and deployment. The goal is to make it really easy to install these tools. You will use Python and various Linux tools to develop software and fix current issues. You will write pull requests and code tools for future on going use in our research lab. It is an excellent way to get experience with this bioinformatics software and could lead to a summer research projects on improving the machine learning aspects of the software.",
        "time-commitment":"5+ hours/week",
        "expectations":"Fix software to allow installing Segway from a Python wheel with a single `pip install segway` command, Develop systems so that Segway and its prerequisites can be easily installed in the following environments: Conda, homebrew-science, Debian (.deb), CentOS/Red Hat Enterprise Linux (.rpm), Docker,  Develop software so that these packaging systems are maintained automatically.",
        "credentials":"At least 2nd year undergraduate in Electrical and Computer Engineering, Engineering Science, Biomedical Engineering, or Computer Science. Experience in Python and Unix environments.",
        "prof":"M. Hoffman",
        "profphoto":"http://www.uhnres.utoronto.ca/researchers/getpic.php?id=60673",
        "bio":"Assistant Professor, Computer Science / Medical Biophysics",
        "link":"https://www.pmgenomics.ca/hoffmanlab/",
        "area":"Computer Science",
        "student":"1 position available"
    },
    {
        "id":"discstores",
        "title":"Web Platform to Discover Stores & Restaurants",
        "description":"The goal of this project is to design and build a website that will enable people to discover stores and restaurants on a street, remember which ones they would like to visit, and share their discoveries with friends.",
        "time-commitment":"5 Hours/Week",
        "expectations":"Provide a 2D aerial view of a street segment, showing each building and what store or restaurant occupies it; digitally “walk” down a street, like Bloor West between Spadina and Bathurst, and visit each of the commercial establishments; Identify buildings based on iterative filtering such as 'restaurant' --> 'japanese restaurant'; Click on a particular building and see a photo of the front of the building with a menu of options including: Address, phone and operating hours,  Add store to wish list of places to visit and highlight buildings in 2D map that are on the wish list,  Attach comments to a store, Share store with friends on Facebook,  Link to store's web site,  Link to Google's map for address, Link to Yelp, if a restaurant",
        "credentials":"Students interested in website design, software development, databases and human factors (i.e., interface design).",
        "prof":"M. Fox",
        "profphoto":"https://www.mie.utoronto.ca/images/people/FoxM_Cropped.jpg",
        "bio":"Professor, Industrial Engineering, Computer Science",
        "link":"http://www.eil.utoronto.ca/profiles/foxpro.html",
        "area":"Computer Science",
        "student":"4 positions available"
    },
    {
        "id":"solarcelltest",
        "title":"Weatherproof Organic Solar Cell Test Apparatus",
        "description":"This project’s goal is to facilitate the testing of experimental organic solar cells in natural sunlight. It focuses on the design of an apparatus which can protect the solar cells and their monitoring equipment from adverse weather conditions without blocking visible light. Other considerations, such as the need for cell replacement and weekly realignment, are also necessary.",
        "time-commitment":"4-6 Hours/Week",
        "expectations":"The student would design the apparatus using a combination of commercially available and CAD-designed components to balance cost and effectiveness. They would perform materials selection with regard to factors such as longevity, weather resistance, cost, thermal expansion, etc. ",
        "credentials":"Student should have a background in mechanical design (i.e mechanical engineering or related experience), as well as familiarity with CAD software",
        "prof":"T.P. Bender",
        "profphoto":"http://www.news.toronto.edu/sites/default/files/Lessard_Polymers_13_04_05.jpg",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/bender.htm",
        "area":"Mechanical Engineering",
        "student":"1 position available"
    },
    {
        "id":"solarcelldata",
        "title":"Automation of Condition-Dependant Organic Solar Cell Data Acquisition",
        "description":"This project’s goal is to facilitate long-term data collection to help analyze experimental organic solar cell performance over time. This would be done by developing Labview code to interface with, automate, and receive measurements from an electronic source meter device. Automatic testing should occur when certain conditions are met, i.e adequate solar illumination.",
        "time-commitment":"4-6 Hours/Week",
        "expectations":"The student would be expected to develop Labview code which would carry out automated tests when certain input conditions are met. A user-friendly interface would be necessary for controlling manual or automatic testing. Additionally, collected data should be organized into a human- and machine-readable format and backed up without user input.",
        "credentials":"Student should be experienced with Labview and interested in automation of coupled input/output systems.",
        "prof":"T.P. Bender",
        "profphoto":"http://www.news.toronto.edu/sites/default/files/Lessard_Polymers_13_04_05.jpg",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/bender.htm",
        "area":"Information Engineering",
        "student":"1 position available"
    },
    {
        "id":"solarcellresearch",
        "title":"Data-Processing Software for Organic Solar Cell Research",
        "description":"This project’s goal is to design MATLAB code meant to collect and analyze raw data relating to organic solar cell research. Data would be sourced from a variety of laboratory equipment and experiments. Output would include summaries of raw data, both through visuals and key parameters, depending on data type.",
        "time-commitment":"4-6 Hours/Week",
        "expectations":"The resulting programs would need to be adaptable, capable of handling varying experimental parameters such as data resolution and size, based on specified criteria. Additionally, filtration of outliers or specific problem detection would be desirable features.",
        "credentials":"Student should be experienced and interested in data analysis using Matlab software.",
        "prof":"T.P. Bender",
        "profphoto":"http://www.news.toronto.edu/sites/default/files/Lessard_Polymers_13_04_05.jpg",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/bender.htm",
        "area":"Information Engineering",
        "student":"1 position available"
    },
    {
        "id":"adapproc",
        "title":"Adaptive Processing in Underwater Synthetic Aperture Sonar Systems",
        "description":"Synthetic Aperture Sonar (SAS) systems use acoustics to probe and form images of the ocean sea bed. One important use of such systems is detecting objects buried or embedded in the sea-bed. Examples include mines and debris. The student would be expected to develop and implement adaptive processing algorithms, that account for the interference seen in real time, to detect small objects – smaller than is currently possible to reliably detect.",
        "time-commitment":"As much as possible without jeopardizing ‘regular’ courses",
        "expectations":"The deliverable would be the algorithm, the  computer program (preferably written in MATLAB) and a report.",
        "credentials":"EE students. Taking/having taken ECE302 a must. Knowledge of DSP preferred.",
        "prof":"R. Adve",
        "profphoto":"http://www.ece.utoronto.ca/wp-content/uploads/2012/11/Adve-R-H350.jpg",
        "bio":"Professor, Communications",
        "link":"http://www.ece.utoronto.ca/people/adve-r/",
        "area":"Information Engineering",
        "student":"1-2 positions available"
    },
    {
        "id":"probanalysis",
        "title":"Teaching and Learning Tools for Problem Analysis",
        "description":"Problem Analysis is a key component in the engineering curriculum, but there are opportunities to improve intentionality around the teaching and learning of problem analysis methods. In this project, students will examine current literature and best practices, determine gaps in instruction, and develop a set of recommendations for students and instructors.",
        "time-commitment":"2-3 Hours/Week",
        "expectations":"The students will complete the following: A literature review on problem analysis in the engineering curriculum, A summary of the challenges faced in engineering problem analysis, from the student perspective, A set of recommendations for both engineering students and instructors to increase the application of good problem analysis techniques",
        "credentials":"At least 2nd Year, any discipline.",
        "prof":"L. Romkey",
        "profphoto":"https://lisaromkey.files.wordpress.com/2011/11/lromkey1.jpg?w=229&h=229",
        "bio":"Senior Lecturer, Engineering Science",
        "link":"https://lisaromkey.wordpress.com/",
        "area":"Information Engineering",
        "student":"1-2 positions available"
    },
    {
        "id":"meastool",
        "title":"Measurement Tool to Evaluate Large Number of Individuals Walking Outdoors",
        "description":"Field-based data collection using a novel measurement tool to quickly evaluate a large number of individuals when walking outdoors in various locations and environmental conditions. The tool is essentially a frame that is set on the ground next to the sidewalk that rigidly holds a video camera with two laser points carefully aligned so the lasers are exactly parallel to each other and the distance between the two lasers is precisely known. We have a version of this device now but need some adjustments to make it reliable. The measurement device will be set up at several locations in Toronto. We will choose 6 locations – 1 sidewalk location with minimal surface irregularity and 5 sidewalk locations with irregularities of various heights (eg 1mm, 2.5mm, 5mm, 7.5mm and 10mm for instance if these can be found). The measurement tool will be set up such that passerby’s do not attend to it’s presence. Data will be acquired at each location for approximately 3 hours per day. A researcher will be present for all data collection sessions. The total number of subjects analyzed will be dependent on the day and time of testing and therefore will differ for each testing location. During data collection, the researcher will note, using his/her own judgment, each subject’s approximate age, sex, type of footwear and if they are using any assistive devices such as canes and walkers or if they are using electronic devices such as cell phones. The video data will be used to estimate foot clearance using the MB Ruler software package. The two laser dots will be visible on lower leg of a passerby. The video will be paused at this point to calibrate the software using the known distance between the two laser dots. The video will then be played forward frame by frame to find the frame where the foot achieve minimum clearance with the sidewalk during swing phase. The foot clearance at this point will be estimated using the software.",
        "time-commitment":"5 Hours/Week (Project to be completed in 8 months)",
        "expectations":"Students should be able to collect and process over a 2 semester period.",
        "credentials":"Any discipline, may be of particular interest for Civil / Biomed students",
        "prof":"G. Fernie",
        "profphoto":"http://carleton.ca/accessibilitysummit/wp-content/uploads/JF-240x294.jpg",
        "bio":"Professor, Department of Surgery, Institute of Biomaterials and Biomedical Engineering",
        "link":"http://www.uhnres.utoronto.ca/researchers/profile.php?lookup=56382",
        "area":"Information Engineering",
        "student":"2-3 positions available"
    },
    {
        "id":"kinectscanning",
        "title":"Sidewalk Scanning Device to Locate Areas with Obstacles",
        "description":"Development of a tool based on a structured-light sensor (like the Microsoft Kinect) to measure walkway discontinuities to allow for survey of many sidewalks quickly and accurately. This would require students with programming knowledge to develop software that could be used to process depth data from a Kinect sensor and flag any obstacles that exceed some threshold and log the GPS coordinates for these locations. This project will involve an iterative design and testing cycle to develop the structured light sensor-based survey tool capable of accurately geo-tagging the locations of walkway discontinuities that exceed a specified threshold. The students working on this will need to build some type of battery powered wheeled cart that houses the sensor and shades the ground from sunlight to avoid interference. The idea is that once we know the height of obstacle that is a tripping hazard, we need some type of automated devices to go and find and geotag them. Imagine your device being attached to a street sweeper or other similar maintenance vehicle that regularly travels around the city’s sidewalks. It could log the locations of problem obstacles targeting them for repair.",
        "time-commitment":"5 Hours/Week",
        "expectations":"Students will work together to develop a functional prototype",
        "credentials":"Computer Engineering students preferred.",
        "prof":"G. Fernie",
        "profphoto":"http://carleton.ca/accessibilitysummit/wp-content/uploads/JF-240x294.jpg",
        "bio":"Professor, Department of Surgery, Institute of Biomaterials and Biomedical Engineering",
        "link":"http://www.uhnres.utoronto.ca/researchers/profile.php?lookup=56382",
        "area":"Information Engineering",
        "student":"2-3 positions available"
    },
    {
        "id":"3dfrontend",
        "title":"Creating an Interactive 3D GUI for Simulating Cancer Treatment Scenarios",
        "description":"Our research group works on a targeted, minimally-invasive light-activated cancer treatment called Photodynamic Therapy (PDT). To assist in predicting treatment outcomes, we have created the fastest open-source CPU-based simulator, as well as the only existing GPU and FPGA-accelerated implementations of the code. The project will involve creating an interactive 3D graphical front-end for setting up treatment scenarios (placing multiple light sources within the area) and evaluating outcomes (light dose delivered to the target tumour vs. surrounding tissue). The project uses C++ and Tcl, with the open-source Visualization Toolkit (VTK/ www.vtk.org) library for 3D rendering. We have access to actual (anonymized) patient data including MRI/CT images for the purpose. The project is highly visual, and has the potential to impact upcoming clinical trials if done well.",
        "time-commitment":"5 Hours/Week",
        "expectations":"A GUI that allows one to place light probes with mouse clicks / dialog boxes, and visualize where the light sources are in 3D space. If time permits, some additional output visualization options (of the light density results that come back from the simulator) could also be added.",
        "credentials":"ECE student with strong programming skills. Knowledge of C++ essential, knowledge of Tcl an asset.",
        "prof":"V. Betz",
        "profphoto":"http://www.eecg.toronto.edu/~vaughn/Vaughn_Betz_small.jpg",
        "bio":"Associate Professor, Computer Engineering",
        "link":"http://www.eecg.toronto.edu/~vaughn/",
        "area":"Computer Engineering",
        "student":"1-2 positions available"
    },
    {
        "id":"javagui",
        "title":"Building a GUI for the Lynx CAD Tool",
        "description":"Build a design entry graphical user interface, in Java, for a new Computer-Aided Design (CAD) tool called Lynx that one of my PhD students is developing.  The CAD tool helps engineers design the interconnection between hardware modules in large FPGA designs.  This project would teach you about software engineering in Java for a larger project, how to develop user interfaces for complex programs, and some about how CAD tools work and large electronic designs are constructed.",
        "time-commitment":"5 Hours/Week",
        "expectations":"Work with a PhD student to define the user interface -- what data is needed, and how can you make this easy and intuitive for a designer to enter? How can you visualize the system so the designer can see what he/she has asked for. Then code this user interface and connect its data output to the actual CAD tool.  Test the interface on engineers and refine it based on their experience.",
        "credentials":"ECE student with strong programming skills. Knowledge of java (or willingness to learn it) required. Experience with git-based revision control and java-based UI design are assets.",
        "prof":"V. Betz",
        "profphoto":"http://www.eecg.toronto.edu/~vaughn/Vaughn_Betz_small.jpg",
        "bio":"Associate Professor, Computer Engineering",
        "link":"http://www.eecg.toronto.edu/~vaughn/",
        "area":"Computer Engineering",
        "student":"1 position available"
    },
    {
        "id":"wettingbehaviour",
        "title":"Understanding the Wetting Behavior of a Surface",
        "description":"Understanding the wetting behavior of a surface is important to many industries and applications, such as coatings, corrosion protection and even detergency (removal of oils from a surface). This is challenging as it is dependent on the nature of the solid and the actual liquid that is in contact with it. This has been widely studied for polymer surfaces exposed to air and a liquid drop laid on the surface by measuring the contact between the drop and the surface. On the other hand, when the solid is underwater this behavior changes, furthermore, if surfactants and salts are added to the water, the wetting behavior of an oil on the surface can be completely shifted depending upon the concentrations of each species. However, this phenomenon is still not fully understood and only limited studies exist. Therefore, the goal of this project will be the measurement of contact angles of oils (Toluene, cyclohexane) on different solids (metals, glass, polymers) underwater in the presence and absence of surfactants at different concentrations with the purpose of generating a wettability map as a function of the concentrations of the different species. This data will advance the understanding of the wetting behavior of a system and allow to tune its properties to the desired value. Candidates will be interviewed by PhD candidate in charge of the project.",
        "time-commitment":"5 Hours/Week",
        "expectations":"We expect the student prepare solutions of different surfactant systems and measure the underwater contact angle by using an instrument called Goniometer to take pictures of the formed drop and then process those image with an in-house software to get actual value. A minimum of 4 surfaces are expected to be studied for a total of 15 formulations each (oil/water/surfactant combinations). At the end, the student should plot the results on a specified plot to comparatively show the changes in wetting behavior for each system tested.",
        "credentials":"At least 2nd Year, Experienced with the Chemistry Lab as preparation of solutions might be required. Also needs to be very responsible in the handling of delicate and small equipment (Glass and Needles) and during the actual measurements as accuracy is required.",
        "prof":"E.J. Acosta",
        "profphoto":"http://www.chem-eng.utoronto.ca/Assets/CHEMENG+Digital+Assets/CHEMENG/Chemical+Engineering+Digital+Assets/Faculty+Photos/Edgard+Acosta+2.png",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/acosta.htm",
        "area":"Chemical Engineering",
        "student":"1 position available"
    },
    {
        "id":"measureatmosph",
        "title":"Measuring the Concentrations of Trace Gases in the Atmosphere",
        "description":"The student will work in the Atmospheric Physics group at the University of Toronto, which has an active program in remote sounding of atmospheric composition from ground-based, balloon, and satellite platforms, along with supporting radiative transfer studies and laboratory spectroscopy. The student will join a research group that is involved in a wide variety of projects that use UV-visible and Fourier transform infrared (FTIR) spectrometers to improve the measurements the concentrations of trace gases in the atmospheres of Earth and Mars.",
        "time-commitment":"3-6 Hours/Week",
        "expectations":"We are looking for a student to work with a PhD student in the assembly and testing of a new long path White cell for laboratory spectra measurements. The student will work with vacuum, gas handling, opto-mechanical systems, and will gain experience operating an FTIR spectrometer.",
        "credentials":"Engineering or Physics 2nd year +, B+ or higher.  Interest in working with hardware, including vacuum systems, gas handling, and optics.  Some knowledge of computer programming would be an asset",
        "prof":"K. Strong",
        "profphoto":"http://womeninphysicscanada.ca/wp-content/uploads/2015/02/Kim-Strong.jpg",
        "bio":"Professor, Physics",
        "link":"http://www.atmosp.physics.utoronto.ca/people/strong/strong.html",
        "area":"Atmospheric Physics",
        "student":"1 position available"
    }
]