[
    {
        "id":"nervestimu",
        "title":"Peripheral Nerve Stimulation",
        "description":"Peripheral nerve stimulation is emerging as a potential long-term therapy for Overactive Bladder. The aim of this study is to investigate the feasibility of selectively activating therapeutically-relevant nerve(s) by transcutaneous electrical nerve stimulation.",        "expectations":"Some example questions that the student should investigate include: Why do some stations empty while at others the arrivals and departures tend to balance? Why are some stations busy while other, close-by stations are not? What is the optimal station size for a given location? What are the best locations? What is the mix of subscription users vs. casual users at a given location and can this be predicted? What is the optimal size of the system? What is the best pricing for subscriptions and casual users?",
        "time-commitment":"2-3 Hours/Week",
        "expectations":"Conduct feasibility tests of electrically activating peripheral nerves in human participants.",
        "credentials":"Any year and discipline.",
        "prof":"P. Yoo",
        "profphoto":"http://ibbme.utoronto.ca/wp-content/uploads/2013/08/Paul-Yoo-133x200.jpg",
        "bio":"Associate Professor, Biomaterials & Biomedical Engineering / Electrical & Computer Engineering",
        "link":"http://www.ibbme.utoronto.ca/faculty/core-faculty/paul-yoo/",
        "area":"Biomedical Engineering",
        "student":"3-5 positions available"
    },
    {
        "id":"globalclim",
        "title":"Global Climate Model Reconstruction",
        "description":"The idea of this project is to build a reconstruction of the first ever global climate model. The original model was developed in 1895, by a Swedish scientist, Svante Arrhenius. Most histories of climate science credit him with the discovery of global warming, although at the time he was really trying to prove that a drop in carbon dioxide concentrations in the atmosphere could have caused the ice ages. His model was at least fifty years ahead of its time, both scientifically and computationally - most notably, there were no digital computers at the time, so all his calculations were done by hand. The model is interesting today because it demonstrates some subtle properties of the greenhouse effect, beyond what is taught in most classrooms. So far as I can discover, nobody has attempted a modern-day reconstruction of his model. The goal of this project is to implement his model in a modern programming language, and put it on the web so that students learning about climate change can run it and see what it does. Depending on interest, the project could also include building a graphical front end to illustrate how the model works, and to develop variants of the model that incorporate more recent data, e.g. satellite measurements of carbon dioxide concentrations and infra-red absorption.",
        "time-commitment":"Open, depending on interest and commitment.",
        "expectations":"The project is open ended. A working program should be relatively straightforward for a reasonably competent programmer. Further enhancements (e.g. web design, graphical representations, etc) will depend on interest and ability. We could also attempt to track down original notebooks and other sources from these scientists, and explore variants of the original model.",
        "credentials":"Any discipline. Requires a student with competent programming skills, and an interest in (or willingness to learn) the history of science and the early development of climate science. Experience with web design and graphical user interfaces would also be helpful.",
        "prof":"S. Easterbrook",
        "profphoto":"http://www.cs.toronto.edu/~sme/images/photos/me21.jpg",
        "bio":"Professor, Computer Science",
        "link":"http://www.cs.toronto.edu/~sme/",
        "area":"Computer Science",
        "student":"1-2 positions available"
    },
    {
        "id":"epigenomics",
        "title":"Epigenomics analysis software packaging",
        "description":"You will contribute to open source computational biology projects such as Segway and Genomedata to facilitate their distribution and deployment. The goal is to make it really easy to install these tools. You will use Python and various Linux tools to develop software and fix current issues. You will write pull requests and code tools for future on going use in our research lab. It is an excellent way to get experience with this bioinformatics software and could lead to a summer research projects on improving the machine learning aspects of the software.",
        "time-commitment":"5+ hours/week",
        "expectations":"Fix software to allow installing Segway from a Python wheel with a single `pip install segway` command, Develop systems so that Segway and its prerequisites can be easily installed in the following environments: Conda, homebrew-science, Debian (.deb), CentOS/Red Hat Enterprise Linux (.rpm), Docker,  Develop software so that these packaging systems are maintained automatically.",
        "credentials":"At least 2nd year undergraduate in Electrical and Computer Engineering, Engineering Science, Biomedical Engineering, or Computer Science. Experience in Python and Unix environments.",
        "prof":"M. Hoffman",
        "profphoto":"http://www.uhnres.utoronto.ca/researchers/getpic.php?id=60673",
        "bio":"Assistant Professor, Computer Science / Medical Biophysics",
        "link":"https://www.pmgenomics.ca/hoffmanlab/",
        "area":"Computer Science",
        "student":"1 position available"
    },
    {
        "id":"solarcelltest",
        "title":"Weatherproof Organic Solar Cell Test Apparatus",
        "description":"This project’s goal is to facilitate the testing of experimental organic solar cells in natural sunlight. It focuses on the design of an apparatus which can protect the solar cells and their monitoring equipment from adverse weather conditions without blocking visible light. Other considerations, such as the need for cell replacement and weekly realignment, are also necessary.",
        "time-commitment":"4-6 Hours/Week",
        "expectations":"The student would design the apparatus using a combination of commercially available and CAD-designed components to balance cost and effectiveness. They would perform materials selection with regard to factors such as longevity, weather resistance, cost, thermal expansion, etc. ",
        "credentials":"Student should have a background in mechanical design (i.e mechanical engineering or related experience), as well as familiarity with CAD software",
        "prof":"T.P. Bender",
        "profphoto":"http://www.news.toronto.edu/sites/default/files/Lessard_Polymers_13_04_05.jpg",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/bender.htm",
        "area":"Mechanical Engineering",
        "student":"1 position available"
    },
    {
        "id":"solarcelldata",
        "title":"Automation of Condition-Dependant Organic Solar Cell Data Acquisition",
        "description":"This project’s goal is to facilitate long-term data collection to help analyze experimental organic solar cell performance over time. This would be done by developing Labview code to interface with, automate, and receive measurements from an electronic source meter device. Automatic testing should occur when certain conditions are met, i.e adequate solar illumination.",
        "time-commitment":"4-6 Hours/Week",
        "expectations":"The student would be expected to develop Labview code which would carry out automated tests when certain input conditions are met. A user-friendly interface would be necessary for controlling manual or automatic testing. Additionally, collected data should be organized into a human- and machine-readable format and backed up without user input.",
        "credentials":"Student should be experienced with Labview and interested in automation of coupled input/output systems.",
        "prof":"T.P. Bender",
        "profphoto":"http://www.news.toronto.edu/sites/default/files/Lessard_Polymers_13_04_05.jpg",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/bender.htm",
        "area":"Information Engineering",
        "student":"1 position available"
    },
    {
        "id":"solarcellresearch",
        "title":"Data-Processing Software for Organic Solar Cell Research",
        "description":"This project’s goal is to design MATLAB code meant to collect and analyze raw data relating to organic solar cell research. Data would be sourced from a variety of laboratory equipment and experiments. Output would include summaries of raw data, both through visuals and key parameters, depending on data type.",
        "time-commitment":"4-6 Hours/Week",
        "expectations":"The resulting programs would need to be adaptable, capable of handling varying experimental parameters such as data resolution and size, based on specified criteria. Additionally, filtration of outliers or specific problem detection would be desirable features.",
        "credentials":"Student should be experienced and interested in data analysis using Matlab software.",
        "prof":"T.P. Bender",
        "profphoto":"http://www.news.toronto.edu/sites/default/files/Lessard_Polymers_13_04_05.jpg",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/bender.htm",
        "area":"Information Engineering",
        "student":"1 position available"
    },
    {
        "id":"probanalysis",
        "title":"Teaching and Learning Tools for Problem Analysis",
        "description":"Problem Analysis is a key component in the engineering curriculum, but there are opportunities to improve intentionality around the teaching and learning of problem analysis methods. In this project, students will examine current literature and best practices, determine gaps in instruction, and develop a set of recommendations for students and instructors.",
        "time-commitment":"2-3 Hours/Week",
        "expectations":"The students will complete the following: A literature review on problem analysis in the engineering curriculum, A summary of the challenges faced in engineering problem analysis, from the student perspective, A set of recommendations for both engineering students and instructors to increase the application of good problem analysis techniques",
        "credentials":"At least 2nd Year, any discipline.",
        "prof":"L. Romkey",
        "profphoto":"https://lisaromkey.files.wordpress.com/2011/11/lromkey1.jpg?w=229&h=229",
        "bio":"Senior Lecturer, Engineering Science",
        "link":"https://lisaromkey.wordpress.com/",
        "area":"Engineering Education",
        "student":"1-2 positions available"
    },
    {
        "id":"discstores",
        "title":"Web Platform to Discover Stores & Restaurants",
        "description":"The goal of this project is to design and build a website that will enable people to discover stores and restaurants on a street, remember which ones they would like to visit, and share their discoveries with friends.",
        "time-commitment":"5 Hours/Week",
        "expectations":"Provide a 2D aerial view of a street segment, showing each building and what store or restaurant occupies it; digitally “walk” down a street, like Bloor West between Spadina and Bathurst, and visit each of the commercial establishments; Identify buildings based on iterative filtering such as 'restaurant' --> 'japanese restaurant'; Click on a particular building and see a photo of the front of the building with a menu of options including: Address, phone and operating hours,  Add store to wish list of places to visit and highlight buildings in 2D map that are on the wish list,  Attach comments to a store, Share store with friends on Facebook,  Link to store's web site,  Link to Google's map for address, Link to Yelp, if a restaurant",
        "credentials":"Students interested in website design, software development, databases and human factors (i.e., interface design).",
        "prof":"M. Fox",
        "profphoto":"https://www.mie.utoronto.ca/images/people/FoxM_Cropped.jpg",
        "bio":"Professor, Industrial Engineering, Computer Science",
        "link":"http://www.eil.utoronto.ca/profiles/foxpro.html",
        "area":"Computer Science",
        "student":"4 positions available"
    },
    {
        "id":"wettingbehaviour",
        "title":"Understanding the Wetting Behavior of a Surface",
        "description":"Understanding the wetting behavior of a surface is important to many industries and applications, such as coatings, corrosion protection and even detergency (removal of oils from a surface). This is challenging as it is dependent on the nature of the solid and the actual liquid that is in contact with it. This has been widely studied for polymer surfaces exposed to air and a liquid drop laid on the surface by measuring the contact between the drop and the surface. On the other hand, when the solid is underwater this behavior changes, furthermore, if surfactants and salts are added to the water, the wetting behavior of an oil on the surface can be completely shifted depending upon the concentrations of each species. However, this phenomenon is still not fully understood and only limited studies exist. Therefore, the goal of this project will be the measurement of contact angles of oils (Toluene, cyclohexane) on different solids (metals, glass, polymers) underwater in the presence and absence of surfactants at different concentrations with the purpose of generating a wettability map as a function of the concentrations of the different species. This data will advance the understanding of the wetting behavior of a system and allow to tune its properties to the desired value. Candidates will be interviewed by PhD candidate in charge of the project.",
        "time-commitment":"5 Hours/Week",
        "expectations":"We expect the student prepare solutions of different surfactant systems and measure the underwater contact angle by using an instrument called Goniometer to take pictures of the formed drop and then process those image with an in-house software to get actual value. A minimum of 4 surfaces are expected to be studied for a total of 15 formulations each (oil/water/surfactant combinations). At the end, the student should plot the results on a specified plot to comparatively show the changes in wetting behavior for each system tested.",
        "credentials":"At least 2nd Year, Experienced with the Chemistry Lab as preparation of solutions might be required. Also needs to be very responsible in the handling of delicate and small equipment (Glass and Needles) and during the actual measurements as accuracy is required.",
        "prof":"E.J. Acosta",
        "profphoto":"http://www.chem-eng.utoronto.ca/Assets/CHEMENG+Digital+Assets/CHEMENG/Chemical+Engineering+Digital+Assets/Faculty+Photos/Edgard+Acosta+2.png",
        "bio":"Chemical Engineering & Applied Chemistry",
        "link":"http://www.chem-eng.utoronto.ca/facultystaff/profs/acosta.htm",
        "area":"Chemical Engineering",
        "student":"1 position available"
    },
    {
        "id":"measureatmosph",
        "title":"Measuring the Concentrations of Trace Gases in the Atmosphere",
        "description":"The student will work in the Atmospheric Physics group at the University of Toronto, which has an active program in remote sounding of atmospheric composition from ground-based, balloon, and satellite platforms, along with supporting radiative transfer studies and laboratory spectroscopy. The student will join a research group that is involved in a wide variety of projects that use UV-visible and Fourier transform infrared (FTIR) spectrometers to improve the measurements the concentrations of trace gases in the atmospheres of Earth and Mars.",
        "time-commitment":"3-6 Hours/Week",
        "expectations":"We are looking for a student to work with a PhD student in the assembly and testing of a new long path White cell for laboratory spectra measurements. The student will work with vacuum, gas handling, opto-mechanical systems, and will gain experience operating an FTIR spectrometer.",
        "credentials":"Engineering or Physics 2nd year +, B+ or higher.  Interest in working with hardware, including vacuum systems, gas handling, and optics.  Some knowledge of computer programming would be an asset",
        "prof":"K. Strong",
        "profphoto":"http://womeninphysicscanada.ca/wp-content/uploads/2015/02/Kim-Strong.jpg",
        "bio":"Professor, Physics",
        "link":"http://www.atmosp.physics.utoronto.ca/people/strong/strong.html",
        "area":"Atmospheric Physics",
        "student":"1 position available"
    }
]