[
    {
        "id":"bikeshare",
        "title":"Mining the City of Toronto Bike Share Data",
        "description":"Like a number of cities around the world, the City of Toronto is in the process of making the raw data on its Bike Share program (formerly Bixi Bikes) publicly available. I am proposing an open-ended project focused on the analysis of this data and its combination with other publicly available data to address operational, tactical, and strategic management questions for the Bike Share network. The project will encompass diving into and understanding the data, data visualization, the development of interesting questions, identification of other data sources, and the development of data-driven tools (e.g., statistical models, simulations, optimization models) to answer the questions.",
        "expectations":"Some example questions that the student should investigate include: Why do some stations empty while at others the arrivals and departures tend to balance? Why are some stations busy while other, close-by stations are not? What is the optimal station size for a given location? What are the best locations? What is the mix of subscription users vs. casual users at a given location and can this be predicted? What is the optimal size of the system? What is the best pricing for subscriptions and casual users?",
        "timecommitment":"Flexible",
        "credentials":"The students should be in 1st or 2nd year Indy and ECE. Programming experience would be great, but not required.",
        "prof":"C. Beck",
        "profphoto":"cbeck.jpg",
        "bio":"Associate Professor, Industrial Engineering / Computer Science",
        "link":"http://tidel.mie.utoronto.ca/",
        "areaid":"info",
        "area":"Information Engineering",
        "student":"4 Positions Vacant"
    },
    {
        "id":"medops",
        "title":"Medical Operations Research",
        "description":"The lab currently works on medical decision making with a focus on pubic health. A few of the projects we are investigating at the moment are: Modelling the spread of pandemic diseases using simulations within cities, Design of radiation therapy using optimization methods and Operating room scheduling",
        "expectations":"By the end of the project, the student will contribute to one of the projects described by analyzing new data or supporting research currently underway.",
        "timecommitment":"Flexible",
        "credentials":"Students should be from Industrial Engineering and should be familiar with: mathematical optimization, operations research and programming.",
        "prof":"D. Aleman",
        "profphoto":"daleman.jpg",
        "bio":"Associate Professor, Industrial Engineering",
        "link":"http://www.mie.utoronto.ca/faculty/aleman",
        "areaid":"op",
        "area":"Operations Research",
        "student":"4 Positions Vacant"
    },
    {
        "id":"solaruav",
        "title":"Solar Assisted UAV",
        "description":"This project explores the possibility of extending the flight time of electric unmanned aerial vehicles (UAV) via the use of solar cells affixed to the surface of the wings and fuselage. This project is primary focused on the electrical (rather than the aerodynamic) aspects. This includes the selection of an suitable air-frame, solar cells, drive motor, speed control, power converters, rechargeable batteries and the design of the over power management system.",
        "expectations":"Students are expected to demonstrate the benefits of solar power assistance using a flyable UAV. This include extended flight time with usable payload.",
        "timecommitment":"4-6 hours / Week",
        "credentials":"Students should have a good understanding and keen interests in power electronic circuits. Good laboratory skills and mechanical craftsmanship will be a plus in the construction of the prototypes.",
        "prof":"W. T. Ng",
        "profphoto":"wtng.jpg",
        "bio":"Professor, Electronics",
        "link":"http://www.vrg.utoronto.ca/~ngwt/",
        "areaid":"elec",
        "area":"Electronics",
        "student":"2 Positions Vacant"
    },
    {
        "id":"memsys",
        "title":"Measuring the Memory System Behavior of Emerging Cloud Workloads",
        "description":"The landscape of computing applications is changing. New applications are emerging fueled by the always on connectivity offered by modern networking technologies. Among those are cloud-based applications. At the same time, building machines that can sustain these workloads is becoming even more important. This project will require the installation of a set of cloud-based workloads for the purposes of computer architecture research. Given sufficient progress, the project will proceed to measure certain aspects of memory system behavior.",
        "expectations":"Installation of the Cloud Suite II workloads on a x86 system. Creation of virtual machine images to be ran under QEMU. If sufficient time, using the Qtrace extension of QEMU measure memory system behavior.",
        "timecommitment":"2 hours / Week",
        "credentials":"You should be comfortable setting up and debugging your own systems. The project will require working with open source software and installing the OS, etc. There will be library and other software incompatibilities you'll have to overcome. Some understanding of assembly language for any architecture would be a plus.",
        "prof":"A. Moshovos",
        "profphoto":"amoshovos.jpg",
        "bio":"Professor, Computer Engineering",
        "link":"http://www.eecg.utoronto.ca/~moshovos/",
        "areaid":"compeng",
        "area":"Computer Engineering",
        "student":"4 Positions Vacant"
    },
    {
        "id":"betterfpga",
        "title":"A Better FPGA",
        "description":"A Better FPGA: Using Networks on Chip to link hardware modules designed with High-level Synthesis. Performing computations in hardware with FPGAs can be vastly more efficient in power and cost than performing them in software with CPUs, but designing a complete system in an FPGA remains time-consuming. In this project you will explore how incorporating networks on chip (basically tiny routers like those used in the internet) on a future FPGA could help speed up design of FPGA circuits. You will use Xilinx's Vivado High-Level Synthesis tool to develop several computation 'kernels' and interface these kernels with a network on chip designed by my research group, and measure the efficiency of the resulting system.",
        "expectations":"1. Several complete compute kernels (hardware modules) designed using Xilinx's Vivado HLS 2. At least one system that links these kernels using a network on chip. This will require simulating the system in a tool called ModelSim to show it works; you will not actually build the chip.",
        "timecommitment":"6 hours / Week",
        "credentials":"1. Understanding of hardware and Verilog 2. Interest in and basic knowledge of hardware and computer architecture 3. Willingness and ability to learn new CAD tools and more advanced hardware design - this will require some background reading.",
        "prof":"V. Betz",
        "profphoto":"vbetz.jpg",
        "bio":"Associate Professor, Computer Engineering",
        "link":"http://www.eecg.toronto.edu/~vaughn/",
        "areaid":"compeng",
        "area":"Computer Engineering",
        "student":"2 Positions Vacant"
    },
    {
        "id":"highpwrlasers",
        "title":"Controlling high power lasers",
        "description":"The student would work with a postdoc to develop and improve on hardware/software interfaces, beam control and diagnostic systems for advanced laser processing used in research on 3D printing of optical circuits and nano lab systems in optical fiber and thin films. Real time control and monitoring of the laser interaction physics are essential in improving the quality of devices and their potential integration, and would serve in our quest to invent new types of manufacturing methods and devices.",
        "expectations":"Programming to improved command line control program, develop Graphical user interface on two laser systems, DAC circuit design to interface laser tools with computer, Documentation of the programs and circuit, testing and verification of control systems, support on laser processing development.",
        "timecommitment":"5+ hours / Week",
        "credentials":"Engineering Science, ECE, Mech Eng, Physics 2nd year +, B+ or higher. Knowledge of computer programming (python, C++ or .net) Basic understanding of analog and digital electronics. Enthusiasm and willing to learn new technologies.",
        "prof":"P. Herman",
        "profphoto":"pherman.jpg",
        "bio":"Professor, Photonics",
        "link":"http://photonics.light.utoronto.ca/laserphotonics/",
        "areaid":"photonics",
        "area":"Photonics",
        "student":"2 Positions Vacant"
    },
    {
        "id":"socinfo",
        "title":"Discoverying and Integrating Social Service Information from Across the Web",
        "description":"The project will develop software that will crawl the web to discover information about social services that are delivered within a city.  It will combine information from multiple sources and integrate it using a shared representation based on Semantic Web principles.",
        "expectations":"A software tool that will extract and integrate social service related information from various sources found on the Web.",
        "timecommitment":"2 hours / Week",
        "credentials":"Students with a strong interest in software and the web.",
        "prof":"M. Fox",
        "profphoto":"mfox.jpg",
        "bio":"Professor, Industrial Engineering, Computer Science",
        "link":"http://www.eil.utoronto.ca/profiles/foxpro.html",
        "areaid":"compeng",
        "area":"Computer Engineering",
        "student":"2 Positions Vacant"
    },
    {
        "id":"nextgenantenna",
        "title":"Next Generation Antennas for Wireless LANs and 4G Systems",
        "description":"Next generation handsets and wireless network devices make use of advanced multi-antenna concepts such as multi-input multi-output (MIMO) systems, and carrier aggregation (CA).  These concepts require packing many antennas into a small terminal (handset or base station), which can become challenging because the crosstalk between the antennas becomes quite high.  An emerging antenna architecture combines multiple signal ports into a single radiator while virtually eliminating the crosstalk between the ports.  Students will devise both computer analysis techniques and potential antenna designs using this concept in modern wireless devices.",
        "expectations":"Students will be responsible for implementing some mathematical concepts into computer simulations that will aid them in the subsequent analysis and design of the proposed antenna.  They will then devise antenna concepts in an antenna simulation package, and potentially fabricate an antenna for replacing the bulky antenna arrays used in commercial 802.11 wireless LAN access points.",
        "timecommitment":"5 hours / Week",
        "credentials":"ECE students preferred.  Knowledge of linear algebra is required.  Proficiency in MATLAB and ideally Python would be an asset for the computer part.  Basic electromagnetics knowledge (gained through ECE221 and ECE320) would be helpful but not absolutely required. Industriousness is valued, and students should not be afraid to get their 'hands dirty' taking apart electronics and integrating in their own custom solutions.",
        "prof":"S. Hum",
        "profphoto":"shum.jpg",
        "bio":"Associate Professor, Electromagnetics",
        "link":"http://www.waves.utoronto.ca/prof/svhum/",
        "areaid":"elec",
        "area":"Electronics",
        "student":"2 Positions Vacant"
    },
    {
        "id":"ashrae",
        "title":"ASHRAE Student Design Project Competition",
        "description":"ASHRAE sponsors these competitions to encourage students to become involved in a profession that is crucial to insuring a sustainable future for our Earth – the design of energy-efficient HVAC systems. ASHRAE will recognize the outstanding student design projects at the 2016 ASHRAE Winter Meeting to be held in Orlando, FL, January 23-27th, 2016. The student design competition's guidelines provide enough background information to enable the teams to design or select the HVAC system for the given building, or to design a sustainable building implementing an integrated building design process (the architectural and building design for sustainability, and its supporting mechanical and electrical systems) for the given program. Teams may compete in one of the four categories: HVAC Design Calculations, HVAC System Selection, Integrated Sustainable Building Design (ISBD), The Applied Engineering Challenge. ASHRAE recommends that the project groups consist of at least two members from an undergraduate engineering or architecture curriculum for the HVAC Design Calculations or HVAC System Selection and at least three members (architecture or construction, mechanical & electrical) for the ISBD competition. Team members can be from multiple colleges. All team members must be enrolled during the semester/term in which they contribute to the design. The Applied Engineering Challenge is for a team of 1 to 6 engineering students with a keen interest in sustainable design of equipment. More information can be found here: https://www.ashrae.org/membership--conferences/student-zone/design-competition",        "expectations":"The 2015 student competition focuses on a 3-story classroom and office building in Doha, Qatar. Unlike past competitions the building must be located in Doha, Qatar, or the entry will be disqualified. The final HVAC System Selection and Design for the proposed building shall address the following major design goals: low life cycle cost, low environmental impact, comfort and health, creative high performance green design, synergy with architecture.",
        "timecommitment":"3 hours / Week",
        "credentials":"Any undergraduate student interested in HVAC systems or willing to learn something new. Any previous experience will be a plus.",
        "prof":"J. Siegel",
        "profphoto":"jsiegel.jpg",
        "bio":"Professor, Civil Engineering",
        "link":"http://www.civil.engineering.utoronto.ca/staff/professors/siegel.htm",
        "areaid":"civil",
        "area":"Civil Engineering",
        "student":"4 Positions Vacant"
    }
]