[
    {
        "title": "Galbraith Society Matlab Workshop",
        "description": "We are excited to present to you our first workshop of the 2015 year on MATLAB, most popular software package for computation and data visualization. We will be introducing the basics of using MATLAB, which is commonly used in both industry and academia and is definitely a useful skill to add to your resume! Our knowledgeable presenters will be providing a step-by-step tutorial on using the most important features of MATLAB, as well as highlighting the capabilities of the program. No prior knowledge of programming or MATLAB is required. Seating is limited!",
        "link": "https://www.facebook.com/events/1414907882143072/",
        "date": "Feb.26",
        "time": "6:00 - 8:00 pm",
        "location": "GB 144"
    },
    {
        "title":"Big Data Symposium",
        "description":"Galbraith Society will be hosting its first symposium this year on Big Data.  Fields from health care to social media are currently benefitting from big data solutions to quantify large and complex amounts of data. At our symposium, industry and academic speakers will speak about how big data is impacting their research, and how it is being applied to solve information challenges worldwide. Keep your eyes open for the posters about our first symposium in November!",
        "link":"https://www.facebook.com/events/1486906144909596/",
        "date":"Nov.6",
        "time":"7:00 - 9:00 pm",
        "location":"SF 1105"
    },
    {
        "title":"Conquering Research Writing: The Article",
        "description":"So you want to write a research article.... Where do you start? What do reviewers look for? How can you make your article stand out? Worry not! Galbraith Society's next journal workshop will teach you about best practices for research articles and literature reviews! Refreshments will be provided!",
        "link":"https://www.facebook.com/events/1492858581000376",
        "date":"Oct.22",
        "time":"6:00 - 8:00 pm",
        "location":"BA 1220"
    }
]